contrib-other/camelse/examples/jbi2jbi/JBI2JBICompositeApp/test/TestCase2/Input.xml


<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:jbi2="http://openesb.org/jbi2camel/message/JBI2JBICamelJBIModule">
    <soapenv:Body>
        <jbi2:AnyMessage>
            <person user="james">
                <firstName>James</firstName>
                <lastName>Strachan</lastName>
                <city>London</city>
            </person>
        </jbi2:AnyMessage>
    </soapenv:Body>
</soapenv:Envelope>